[
    {
      "title": "POWERCOACH 🏋️",
      "year": "2024-2025",
      "image": "https://media.istockphoto.com/id/1165573327/vector/strong-man-with-heavy-barbell-struggle-doing-exercise.jpg?s=612x612&w=0&k=20&c=UbLr-MYZDNOd-BX2ClP21jFSDtmIFfDLefsT64VCvxo=",
      "description": "My current and most long-term project. POWERCOACH is a real-time powerlifting form feedback app built using Flask-SocketIO and Mediapipe for the backend, SwiftUI for the frontend, and websockets to connect them. Just set up your camera, lift, and see and hear form critiques from your POWERCOACH! Currently, the app supports 15 different weightlifting exercises, with audiovisual correction provided through a frame-by-frame hueristic framework. I plan to release a second rollout that uses analysis of a 5-frame sliding window instead, to increase model robustness, as well as support for a larger amount of exercises."
    },
    {
      "title": "NBA Clutch Player Analysis 🏀",
      "year": "2025",
      "image": "https://cdn.nba.com/headshots/nba/latest/1040x760/1641824.png",
      "description": "In the 2025 Fall quarter at UCSD, I was the project manager for a group in the Eclipse (Sports) Analytics club. My project group consisted of 3 fellow data science students at UCSD, who I led to create a Principal Component Analysis + Ridge Regression pipeline to determine what makes a clutch player in the modern NBA (2020-2025). We first used PCA to create a clutch score using unsupervised learning, and then used ridge regression to track the ranked importance of each meta-feature in this clutch score calculation, of which simply the weighted average of each individual player statistic ended up being the most important factor in determining clutchness. The most clutch player, by the metrics defined in this project, ended up being Matas Buzelis."
    },
    {
      "title": "CMI Behavior Detection with Sensor Data 👋",
      "year": "2025",
      "image": "https://elements-resized.envatousercontent.com/elements-cover-images/c82ed5fd-c4f5-49e2-878c-b1a3ca6badbf?w=1200&h=630&cf_fit=crop&q=85&format=jpeg&s=b09b1f87a61c4525197a530d759d26172ef6954d05c3a8ec77a83499f240ec44",
      "description": "In summer 2025 I participated in the Child Mind Institute (CMI) 'Behavior Detection with Sensor Data' Kaggle competition. The goal was to classify body-focused repetitive behaviors (BFRBs) from non-BFRB everyday gestures, in a dataset of over 570,000 gestures. This was my first exposure to time-series analysis with sequential data, and has given me the skills necessary to implement my current sequential sliding window lift analysis framework for POWERCOACH. I engineered an XGBoost + PyTorch neural network pipeline with a high school friend for this project, improving our F1 testing score by ~40% through cross validation optimization of neural network hyperparameters."
    },
    {
      "title": "AI Tuberculosis Detector 🦠",
      "year": "2023",
      "image": "https://img.pikbest.com/png-images/qiantu/prevent-tuberculosis-day-organ-lung-cartoon-anthropomorphic-cartoon-element_2593684.png!sw800",
      "description": "Using OpenCV preprocessing and a Keras convolutional neural network, I trained a convolutional neural network to detect tuberculosis in a dataset of chest X-rays with 98% accuracy on over 4,200 images. Through manual optimization of CNN hyperparameters and layers, I achieved this robust performance."
    },
    {
      "title": "Diabetes Predictor 🩸",
      "year": "2023",
      "image": "https://cdn-icons-png.flaticon.com/512/2966/2966481.png",
      "description": "I developed a diabetes prediction pipeline using LASSO and Naive Bayes classifiers from scikit-learn. Combined with EDA and hyperparameter optimization, I turned this project into yet another Kaggle notebook. The dataset included over 230,000 patient records."
    },
    {
      "title": "Alzheimer’s Diagnosis Model 🧠",
      "year": "2023",
      "image": "https://cdn-icons-png.flaticon.com/512/4149/4149670.png",
      "description": "This was my first full end-to-end data science pipeline, built during UC Irvine’s 2023 ICS Summer Academy. To clean a dataset of over 2,700 healthcare patient questionaire, I collaboratively balanced 'Alzheimers' and 'No Alzheimers' patient classes with SMOTE. Then, we developed a multinomial LASSO regression model that outputted a list of the most important features in this dataset for determining an Alzheimer's diagnosis, which we fed into a random forest model to finish creating a pipeline that could detect Alzheimer’s from medical records using R. We achieved 90% testing accuracy in the end, and combined with EDA using the ggplot2 library, created a presentation to showcase our findings to UC Irvine staff and parents."
    }
]  